tap "homebrew/bundle"
tap "lotyp/homebrew-formulae"

# core/dotfiles
brew "bats-core"
brew "coreutils"
brew "duti"
brew "lotyp/formulae/dockutil"
brew "croc"
brew "diff-so-fancy"
brew "difftastic"
brew "dockutil"
brew "fasd"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "gnu-sed"
brew "goles/battery/battery"
brew "grep"
brew "grip"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "kind"
brew "kubectl"
brew "kubectx"
brew "lynx"
brew "mackup"
brew "mongosh"
brew "mongodb/brew/mongodb-database-tools"
brew "nano"
brew "stow"
brew "thefuck"
brew "topgrade"

# fs/network
brew "bat"
brew "croc"
brew "httpie"
brew "ssh-copy-id"
brew "tree"
brew "unar"
brew "wget"
brew "zoxide"

# search/grep/diff
brew "fd"
brew "fzf"
brew "git-delta"
brew "gnu-sed"
brew "grep"
brew "jq"
brew "psgrep"
brew "ripgrep"
brew "the_silver_searcher"

# languages/tools
brew "gh"
brew "n"
brew "python"
brew "ruby"
brew "rust"
brew "shellcheck"

# media
brew "ffmpeg"
brew "imagemagick"
brew "uni"
brew "webp"

# misc
brew "grip"
